////выдает список классов которые применены к эелементу
el.classList.add('class')

el.classList.remove('class')

/////////////////


////если класс есть то его удалит, а если его нету то добавит
el.classList.toggle('class')
//////////////////////

////проверяет есть ли данный класс в html и возвращает true/false
el.classList.contains('class')
////////////////////////////

///выводит все стили элемента
el.getComputedStyle(el)
/////////////////////////////


////показывает значения между margin и padding
el.clientTop
el.clientLeft
///////////////////////////////////////


///получить фактические значения элемента
el.offsetWidth
el.offsetHeight
//////////////////////////////////////////


///получить фактические значения элемента ,без учета margin и scrollbar
el.clientWidth
el.clientHeight
///////////////////////


///возвращает размеры которые находятся в окне скролла
el.scrollHeight
el.scrollWidth
/////////////////////////////////


///возвращает значение положения скролла
el.scrollLeft
el.scrollTop
/////////////////////


///функции для управления положением скролла
scrollTo    //передвигает скролл на указанную позицию
scrollBy    //
scrollIntoView
//////////////////////


///получить координаты элемента
el.getBoundingClientRect()
////////////////////////////////


///возвращает элемент который находится на выбранной точке. координаты точки ставятся в скобках 2 цифрами
document.elementFromPoint(100,100)
//////////////////////////////////////////////


///
